In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from config import password

In [2]:
csv = pd.read_csv('median_income_data.csv')
csv.head()

,"Table with row headers in column A and column headers in rows 5 and 6, and 60 and 61",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 65,Unnamed: 66,Unnamed: 67,Unnamed: 68,Unnamed: 69,Unnamed: 70,Unnamed: 71,Unnamed: 72,Unnamed: 73,Unnamed: 74
0,Table H-8. Median Household Income by State: ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,(Households as of March of the following year....,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,CURRENT DOLLARS,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,State,2018,NaN,2017 (40),NaN,2017,NaN,2016,NaN,2015,...,1988,NaN,1987 (21),NaN,1986,NaN,1985 (20),NaN,1984 (19),NaN
4,NaN,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,...,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror

In [3]:
# This is how I knew which rows were specifically for Florida

# florida = csv.loc[csv['Table with row headers in column A and column headers in rows 5 and 6, and 60 and 61'] == 'Florida']
# florida

In [4]:
flipped_csv = csv.T.reset_index(); 
flipped_csv.head()

,index,0,1,2,3,4,5,6,7,8,...,105,106,107,108,109,110,111,112,113,114
0,Table with row headers in column A and column ...,Table H-8. Median Household Income by State: ...,(Households as of March of the following year....,CURRENT DOLLARS,State,NaN,United States,Alabama,Alaska,Arizona,...,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming,"Source: U.S. Bureau of the Census, Current Pop...",Footnotes are available at <www.census.gov/top...,NaN
1,Unnamed: 1,NaN,NaN,NaN,2018,Median\nincome,"63,179","49,936","68,734","62,283",...,"77,067","70,066","77,151","79,726","50,573","62,629","62,539",NaN,NaN,NaN
2,Unnamed: 2,NaN,NaN,NaN,NaN,Standard\nerror,420,"2,423","3,390","2,291",...,"2,327","2,350","3,086","3,025","1,337","2,039","3,892",NaN,NaN,NaN
3,Unnamed: 3,NaN,NaN,NaN,2017 (40),Median\nincome,"61,136","50,865","77,987","59,700",...,"71,490","65,234","72,537","73,284","48,102","65,029","60,987",NaN,NaN,NaN
4,Unnamed: 4,NaN,NaN,NaN,NaN,Standard\nerror,322,"1,094","3,718","2,689",...,"2,217","3,389","3,898","2,176","1,308","2,979","3,262",NaN,NaN,NaN

In [5]:
flipped_csv.columns = flipped_csv.iloc[0]
flipped_csv.head()

,"Table with row headers in column A and column headers in rows 5 and 6, and 60 and 61",Table H-8. Median Household Income by State: 1984 to 2018,"(Households as of March of the following year. Income in current and 2018 CPI-U-RS adjusted dollars. (28) Beginning in 2010, standard errors were calculated using replicate weights)",CURRENT DOLLARS,State,NaN,United States,Alabama,Alaska,Arizona,...,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming,"Source: U.S. Bureau of the Census, Current Population Survey, Annual Social and Economic Supplements. For information on confidentiality protection, sampling error, nonsampling error, and definitions, see <www2.census.gov/programs-surveys/cps/techdocs/cpsmar19.pdf>.",Footnotes are available at <www.census.gov/topics/income-poverty/income/guidance/cps-historic-footnotes.html>.,NaN
0,Table with row headers in column A and column ...,Table H-8. Median Household Income by State: ...,(Households as of March of the following year....,CURRENT DOLLARS,State,NaN,United States,Alabama,Alaska,Arizona,...,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming,"Source: U.S. Bureau of the Census, Current Pop...",Footnotes are available at <www.census.gov/top...,NaN
1,Unnamed: 1,NaN,NaN,NaN,2018,Median\nincome,"63,179","49,936","68,734","62,283",...,"77,067","70,066","77,151","79,726","50,573","62,629","62,539",NaN,NaN,NaN
2,Unnamed: 2,NaN,NaN,NaN,NaN,Standard\nerror,420,"2,423","3,390","2,291",...,"2,327","2,350","3,086","3,025","1,337","2,039","3,892",NaN,NaN,NaN
3,Unnamed: 3,NaN,NaN,NaN,2017 (40),Median\nincome,"61,136","50,865","77,987","59,700",...,"71,490","65,234","72,537","73,284","48,102","65,029","60,987",NaN,NaN,NaN
4,Unnamed: 4,NaN,NaN,NaN,NaN,Standard\nerror,322,"1,094","3,718","2,689",...,"2,217","3,389","3,898","2,176","1,308","2,979","3,262",NaN,NaN,NaN

In [6]:
states_years = flipped_csv['State']
years = states_years.dropna(axis=0)
years.head()

0      State      State
0      State      State
1       2018       2018
3  2017 (40)  2017 (40)
5       2017       2017
7       2016       2016

In [7]:
years.dtypes

0
State    object
State    object
dtype: object

In [8]:
# Here we're going to narrow the data set down to states and national averages
getting_states_data = flipped_csv.dropna(axis=1)
getting_states_data

,"Table with row headers in column A and column headers in rows 5 and 6, and 60 and 61",United States,Alabama,Alaska,Arizona,Arkansas,California,Colorado,Connecticut,Delaware,...,South Dakota,Tennessee,Texas,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming
0,Table with row headers in column A and column ...,United States,Alabama,Alaska,Arizona,Arkansas,California,Colorado,Connecticut,Delaware,...,South Dakota,Tennessee,Texas,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming
1,Unnamed: 1,"63,179","49,936","68,734","62,283","49,781","70,489","73,034","72,812","65,012",...,"59,463","56,060","59,785","77,067","70,066","77,151","79,726","50,573","62,629","62,539"
2,Unnamed: 2,420,"2,423","3,390","2,291","2,108","1,233","3,562","5,119","3,599",...,"2,642","1,442","1,372","2,327","2,350","3,086","3,025","1,337","2,039","3,892"
3,Unnamed: 3,"61,136","50,865","77,987","59,700","49,751","70,038","74,984","74,304","64,961",...,"58,301","56,654","61,557","71,490","65,234","72,537","73,284","48,102","65,029","60,987"
4,Unnamed: 4,322,"1,094","3,718","2,689","2,491","1,576","2,661","3,453","5,230",...,"4,083","2,183","1,358","2,217","3,389","3,898","2,176","1,308","2,979","3,262"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
70,Unnamed: 70,129,885,"1,017",718,765,570,926,"1,605","1,212",...,"1,456","1,939","1,127","1,777","2,200","2,356","2,084","1,985","1,761","1,893"
71,Unnamed: 71,"23,618","18,333","34,782","23,877","17,451","26,981","28,182","31,090","22,980",...,"40,488","39,676","52,988","56,325","58,025","63,446","53,562","35,670","51,879","49,279"
72,Unnamed: 72,128,760,"1,089",744,764,350,850,"1,129","1,366",...,"1,567","1,243","1,219","1,567","2,102","2,955","1,687","1,848","2,591","2,341"
73,Unnamed: 73,"22,415","17,310","32,356","21,425","15,674","25,287","25,801","29,951","25,819",...,"44,803","38,739","53,148","53,224","52,118","61,229","57,748","38,880","47,882","54,976"
74,Unnamed: 74,102,605,"1,473",609,748,364,805,"1,238","1,027",...,"2,142","1,330","1,230","1,697","2,269","2,018","1,900","1,403","1,895","1,687"

In [10]:
narrowed_data = df = getting_states_data.loc[:,~getting_states_data.columns.duplicated()]
narrowed_data

,"Table with row headers in column A and column headers in rows 5 and 6, and 60 and 61",United States,Alabama,Alaska,Arizona,Arkansas,California,Colorado,Connecticut,Delaware,...,South Dakota,Tennessee,Texas,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming
0,Table with row headers in column A and column ...,United States,Alabama,Alaska,Arizona,Arkansas,California,Colorado,Connecticut,Delaware,...,South Dakota,Tennessee,Texas,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming
1,Unnamed: 1,"63,179","49,936","68,734","62,283","49,781","70,489","73,034","72,812","65,012",...,"59,463","56,060","59,785","77,067","70,066","77,151","79,726","50,573","62,629","62,539"
2,Unnamed: 2,420,"2,423","3,390","2,291","2,108","1,233","3,562","5,119","3,599",...,"2,642","1,442","1,372","2,327","2,350","3,086","3,025","1,337","2,039","3,892"
3,Unnamed: 3,"61,136","50,865","77,987","59,700","49,751","70,038","74,984","74,304","64,961",...,"56,914","55,306","60,092","69,789","63,682","70,811","71,540","46,957","63,482","59,536"
4,Unnamed: 4,322,"1,094","3,718","2,689","2,491","1,576","2,661","3,453","5,230",...,"3,986","2,131","1,326","2,164","3,308","3,805","2,124","1,277","2,908","3,184"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
70,Unnamed: 70,129,885,"1,017",718,765,570,926,"1,605","1,212",...,664,884,514,810,"1,003","1,074",950,905,803,863
71,Unnamed: 71,"23,618","18,333","34,782","23,877","17,451","26,981","28,182","31,090","22,980",...,"18,142","17,778","23,743","25,238","26,000","28,429","24,000","15,983","23,246","22,081"
72,Unnamed: 72,128,760,"1,089",744,764,350,850,"1,129","1,366",...,702,557,546,702,942,"1,324",756,828,"1,161","1,049"
73,Unnamed: 73,"22,415","17,310","32,356","21,425","15,674","25,287","25,801","29,951","25,819",...,"19,409","16,782","23,024","23,057","22,578","26,525","25,017","16,843","20,743","23,816"
74,Unnamed: 74,102,605,"1,473",609,748,364,805,"1,238","1,027",...,928,576,533,735,983,874,823,608,821,731

In [11]:
# fl_homeless_new = csv_florida.transpose()
# fl_homeless_new

# homeless_new = all_na.T.reset_index(); 
income_table = homeless_new[homeless_new.columns[::-1]]
income_table.head()

,111,110,109,108,107,106,105,104,103,102,...,13,12,11,10,9,8,7,6,5,index
0,Wyoming,Wisconsin,West Virginia,Washington,Virginia,Vermont,Utah,Texas,Tennessee,South Dakota,...,Delaware,Connecticut,Colorado,California,Arkansas,Arizona,Alaska,Alabama,United States,Table with row headers in column A and column ...
1,"62,539","62,629","50,573","79,726","77,151","70,066","77,067","59,785","56,060","59,463",...,"65,012","72,812","73,034","70,489","49,781","62,283","68,734","49,936","63,179",Unnamed: 1
2,"3,892","2,039","1,337","3,025","3,086","2,350","2,327","1,372","1,442","2,642",...,"3,599","5,119","3,562","1,233","2,108","2,291","3,390","2,423",420,Unnamed: 2
3,"60,987","65,029","48,102","73,284","72,537","65,234","71,490","61,557","56,654","58,301",...,"64,961","74,304","74,984","70,038","49,751","59,700","77,987","50,865","61,136",Unnamed: 3
4,"3,262","2,979","1,308","2,176","3,898","3,389","2,217","1,358","2,183","4,083",...,"5,230","3,453","2,661","1,576","2,491","2,689","3,718","1,094",322,Unnamed: 4

In [14]:
arbitrary = income_table.drop(columns =['index'])
arbitrary.head()

,111,110,109,108,107,106,105,104,103,102,...,14,13,12,11,10,9,8,7,6,5
0,Wyoming,Wisconsin,West Virginia,Washington,Virginia,Vermont,Utah,Texas,Tennessee,South Dakota,...,D.C.,Delaware,Connecticut,Colorado,California,Arkansas,Arizona,Alaska,Alabama,United States
1,"62,539","62,629","50,573","79,726","77,151","70,066","77,067","59,785","56,060","59,463",...,"85,750","65,012","72,812","73,034","70,489","49,781","62,283","68,734","49,936","63,179"
2,"3,892","2,039","1,337","3,025","3,086","2,350","2,327","1,372","1,442","2,642",...,"2,659","3,599","5,119","3,562","1,233","2,108","2,291","3,390","2,423",420
3,"60,987","65,029","48,102","73,284","72,537","65,234","71,490","61,557","56,654","58,301",...,"81,282","64,961","74,304","74,984","70,038","49,751","59,700","77,987","50,865","61,136"
4,"3,262","2,979","1,308","2,176","3,898","3,389","2,217","1,358","2,183","4,083",...,"1,903","5,230","3,453","2,661","1,576","2,491","2,689","3,718","1,094",322

In [15]:
arbitrary.to_csv('income_csv_cleaning', index=False)

In [16]:
dirty_csv = pd.read_csv('income_csv_cleaning')
dirty_csv.head()

,111,110,109,108,107,106,105,104,103,102,...,14,13,12,11,10,9,8,7,6,5
0,Wyoming,Wisconsin,West Virginia,Washington,Virginia,Vermont,Utah,Texas,Tennessee,South Dakota,...,D.C.,Delaware,Connecticut,Colorado,California,Arkansas,Arizona,Alaska,Alabama,United States
1,"62,539","62,629","50,573","79,726","77,151","70,066","77,067","59,785","56,060","59,463",...,"85,750","65,012","72,812","73,034","70,489","49,781","62,283","68,734","49,936","63,179"
2,"3,892","2,039","1,337","3,025","3,086","2,350","2,327","1,372","1,442","2,642",...,"2,659","3,599","5,119","3,562","1,233","2,108","2,291","3,390","2,423",420
3,"60,987","65,029","48,102","73,284","72,537","65,234","71,490","61,557","56,654","58,301",...,"81,282","64,961","74,304","74,984","70,038","49,751","59,700","77,987","50,865","61,136"
4,"3,262","2,979","1,308","2,176","3,898","3,389","2,217","1,358","2,183","4,083",...,"1,903","5,230","3,453","2,661","1,576","2,491","2,689","3,718","1,094",322

In [75]:
dirty_csv.rename(columns = {'70': 'Florida', '15': 'Florida_Too', '4': 'Median_Income', '3': 'Year'}, inplace = True)
dirty_csv
dirty_csv.to_csv('final_median_income_csv', index=False)

In [76]:
clean_csv = pd.read_csv('final_median_income_csv')
clean_csv.head()

  Florida Florida_Too   Median_Income       Year
0  54,644      54,644  Median\nincome       2018
1  54,380      53,086  Median\nincome  2017 (40)
2  54,990      53,681  Median\nincome       2017
3  53,551      51,176  Median\nincome       2016
4  51,750      48,825  Median\nincome       2015

In [103]:
# Hey guess what!?
# pgAdmin doesn't like commas...

narrowed_df = clean_csv.drop(['Median_Income'], axis=1)
narrowed_df.rename(columns = {'Florida': 'national_average', 'Florida_Too': 'median_income', 'Year': 'year'}, inplace = True)
narrowed_df.head()

  national_average median_income       year
0           54,644        54,644       2018
1           54,380        53,086  2017 (40)
2           54,990        53,681       2017
3           53,551        51,176       2016
4           51,750        48,825       2015

In [106]:
# Getting rid of them over here
national_average = narrowed_df['national_average'].str.replace("," , "")

In [108]:
# Getting rid of commas right hereeeee...
median_income = narrowed_df['median_income'].str.replace("," , "")

In [126]:
# Turns out pgAdmin doesn't like "( )" either
# So we're removing those here...
year = narrowed_df['year'].str.replace(r"\s*\([^()]*\)","").str.strip()

In [131]:
# Going to have to add them back into the dataframe after they're all cleaned up
median_incomes_florida = pd.DataFrame ({
    'national_average': national_average,
    'median_income': median_income,
    'year': year
})

twelve_yrs = median_incomes_florida.head(12)
twelve_yrs

   national_average median_income  year
0             54644         54644  2018
1             54380         53086  2017
2             54990         53681  2017
3             53551         51176  2016
4             51750         48825  2015
5             48988         46140  2014
6             52400         48532  2013
7             51703         47886  2013
8             50480         46071  2012
9             50468         45105  2011
10            50860         44066  2010
11            53535         45631  2009

In [120]:
postgres_conn_string = f"postgres:{password}" 
engine = create_engine(f"postgresql://{postgres_conn_string}@localhost:5432/housing", paramstyle="format")

In [132]:
twelve_yrs.to_sql(name='incomes', con=engine, if_exists='append', index=False)

In [133]:
pd.read_sql_query('SELECT * FROM incomes', con=engine).head()

   national_average  median_income  year
0             54644          54644  2018
1             54380          53086  2017
2             54990          53681  2017
3             53551          51176  2016
4             51750          48825  2015